backend-api/app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1
---
        }

        $userModel = new UserModel();
        $user      = $userModel->where('username', $username)->first();