backend-api/app/Controllers/Barang.php

    public function index()
    {
        $barang = $this->model
            ->select('barang.*, kategori.nama_kategori')
            ->join('kategori', 'kategori.id = barang.kategori_id', 'left')
            ->findAll();
---
SELECT `barang`.*, `kategori`.`nama_kategori`
FROM `barang`
LEFT JOIN `kategori` ON `kategori`.`id` = `barang`.`kategori_id`