backend-api/app/Controllers/Seed.php

    public function admin()
    {
        $userModel = new UserModel();

        // cek apakah user admin sudah ada
        $existing = $userModel->where('username', 'admin')->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1